In [1]:
import pandas as pd

df = pd.read_csv("data/train.csv", index_col="id")

In [2]:
half_id = len(df) // 2
half_id

1500444

In [3]:
trimmed_df1 = df.query(f"id <= {half_id}")
trimmed_df2 = df.query(f"id > {half_id}")

In [4]:
trimmed_df1.tail()

,date,store_nbr,family,sales,onpromotion
id,,,,,
1500440,2015-04-24,9,PREPARED FOODS,52.313,0
1500441,2015-04-24,9,PRODUCE,0.000,0
1500442,2015-04-24,9,SCHOOL AND OFFICE SUPPLIES,0.000,0
1500443,2015-04-24,9,SEAFOOD,5.000,0
1500444,2015-04-25,1,AUTOMOTIVE,2.000,0

In [5]:
trimmed_df2.head()

               date  store_nbr        family     sales  onpromotion
id
1500445  2015-04-25          1     BABY CARE     0.000            0
1500446  2015-04-25          1        BEAUTY     4.000            0
1500447  2015-04-25          1     BEVERAGES  1249.000            4
1500448  2015-04-25          1         BOOKS     0.000            0
1500449  2015-04-25          1  BREAD/BAKERY   446.691            3

In [6]:
trimmed_df1.to_csv("data/train1.csv")
trimmed_df2.to_csv("data/train2.csv")